Repository: alkoleft/ones_doc_gen
Catalog: lang/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: Properties
ru_ru: Свойства

source: Property
ru_ru: Свойство

source: Value
ru_ru: Значение

source: Attributes
ru_ru: Реквизиты

source: Name
ru_ru: Имя

source: Synonym
ru_ru: Синовим

source: Parse config files
ru_ru: Анализ файлов конфигурации

source: Build documentation
ru_ru: Построение документации

source: name
ru_ru: Имя

source: comment
ru_ru: Комментарий

source: hierarchical
ru_ru: Иерархический

source: hierarchytype
ru_ru: Тип иерархии

source: limitlevelcount
ru_ru: Ограничение количества уровней иерархии

source: levelcount
ru_ru: Количество уровней иерархии

source: foldersontop
ru_ru: Размещать группы сверху

source: usestandardcommands
ru_ru: Использовать стандартные команды

source: owners
ru_ru: Владельцы

source: subordinationuse
ru_ru: Использование подчинения

source: codelength
ru_ru: Длина кода

source: descriptionlength
ru_ru: Длина наименования

source: codetype
ru_ru: Тип кода

source: codeallowedlength
ru_ru: Допустимая дина кода

source: codeseries
ru_ru: Серии кодов

source: checkunique
ru_ru: Контроль уникальности

source: ObjectModule
ru_ru: Модуль объекта

source: ManagerModule
ru_ru: Модуль менеджера

source: RecordSetModule
ru_ru: Модуль набора записей

source: ExternalConnectionModule
ru_ru: Модуль внешнего соединения

source: ManagedApplicationModule
ru_ru: Модуль управляемого соединения

source: OrdinaryApplicationModule
ru_ru: Модуль обычного приложения

source: SessionModule
ru_ru: Модель сеанса
